{"name":"Wenn","headerTaglineOne":"Vonjour 👋","headerTaglineTwo":"I'm Wenn Magallanes - IT Support","headerTaglineThree":"IT Support","headerTaglineFour":" Based in Iligan City","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/wennneth/react-portfolio-template"},{"id":"3","title":"Twitter","link":"https://twitter.com/NethaneilW11164"}],"projects":[{"id":"1","title":"Technical Troubleshooting","description":"Identifying Issues: IT support professionals diagnose and identify hardware, software, and network problems reported by end-users. Troubleshooting: They analyze issues systematically, using problem-solving skills to find solutions efficiently.","imageSrc":"https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":" http://chetanverma.com/"}],"services":[{"id":"2","title":"Customer Assistance","description":"Helpdesk Support: Responding to inquiries and issues raised by end-users via various channels such as phone, email, or chat.\nProviding Guidance: Offering step-by-step guidance to users for problem resolution or walking them through troubleshooting processes."},{"id":"3","title":"Installation and Configuration:","description":"Software and Hardware Setup: Installing, configuring, and updating software applications and computer hardware.\nSystem Deployment: Setting up new computer systems, including desktops, laptops, and peripheral devices."},{"id":"4","title":"Security Measures","description":"Security Implementation: Implementing and maintaining security measures to protect computer systems and sensitive data.\nUser Education: Educating end-users on best practices for information security and safe computing"}],"aboutpara":"Im Wenn Nethaneil Magallanes, Im 24 years old, from Iligan City, Graduated from Mindanao State University At Naawan, Year 2024.  With a degree of Bachelor of Science In Information Technology. I am very responsible, very generous, easy to teach, approachable, friendly towards my fellow workmates. As an IT support i provide a technical services to the business company. IT support is a critical function in ensuring the smooth operation of IT systems within organizations. Professionals in this field play a key role in maintaining technology infrastructure, resolving issues promptly, and providing essential support to end-users, contributing to the overall success of an organization's IT ecosystem.","resume":{"tagline":"👋  I'm an IT Support.","description":"I provide a technical assistant as well as the installation and maintenance of technical system and for troubleshooting common problems related to Internet connectivity, hardware and software, operating systems, and data security and management.","experiences":[{"id":"1","dates":"March 2022 - Present","type":"Part Timer","position":"Call Center Agent","bullets":"BPO central Cebu"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":" March 2020- July 2021","type":"Full Time","position":"Associate Manager","bullets":"Forex Trading"},{"id":"602f2605-4e3e-4274-877f-ce70a49459f4","dates":"July 2021- Present","type":"Full Time","position":"IT support","bullets":"Tesla Usa"}],"education":{"universityName":"Mindanao State University of Naawan","universityDate":"2016-2020","universityPara":"Bachelor of Science in Information Techonology"},"languages":["Javascript","HTML5","CSS","Python","Go"],"frameworks":["React","Typescript","NodeJs"],"others":["Figma","AdobeXD","AWS"]}}